{
    "id": "a641dda7-9b19-4103-b811-76a3963d29d2",
    "title": "State of Palestine - Internal Displacements Updates (IDU) (event data)",
    "name": "idmc-event-data-for-pse",
    "notes": "Conflict and disaster population movement (flows) data for State of Palestine. The data is the most recent available and covers a 180 day time period.   Internally displaced persons are defined according to the 1998 Guiding Principles as people or groups of people who have been forced or obliged to flee or to leave their homes or places of habitual residence, in particular as a result of armed conflict, or to avoid the effects of armed conflict, situations of generalized violence, violations of human rights, or natural or human-made disasters and who have not crossed an international border.   The IDMC's Event data, sourced from the Internal Displacement Updates (IDU), offers initial assessments of internal displacements reported within the last 180 days. This dataset provides provisional information that is continually updated on a daily basis, reflecting the availability of data on new displacements arising from conflicts and disasters. The finalized, carefully curated, and validated estimates are then made accessible through the Global Internal Displacement Database (GIDD). The IDU dataset comprises preliminary estimates aggregated from various publishers or sources.  ",
    "dataset_source": "IDMC",
    "organization": "Internal Displacement Monitoring Centre (IDMC)",
    "dataset_date": "[2024-12-12T00:00:00 TO 2025-06-10T23:59:59]",
    "last_modified": "2025-06-10T08:22:44.752953",
    "data_update_frequency": "Every day",
    "groups": [
        "State of Palestine"
    ],
    "license_title": "Creative Commons Attribution for Intergovernmental Organisations (CC BY-IGO)",
    "methodology": "Other",
    "methodology_other": "IDMC defines an event as any distinct incident, whether prompted by natural hazards or conflict-related violence, resulting in the forced displacement of individuals within a specified geographical area confined to the borders of a single country. Whenever feasible, IDMC adopts the definitions of events provided by primary data sources, encompassing named disasters, government-recognized weather patterns, and conflict-related offensives, each delineated by their specific geographical and temporal parameters.\n\nInternally displaced persons are \"persons or groups of persons who have been forced or obliged to flee or to leave their homes or places of habitual residence, in particular as a result of or in order to avoid the effects of armed conflict, situations of generalized violence, violations of human rights or natural or human-made disasters, and who have not crossed an internationally recognized state border.\"\n\nInternally displaced people are often confused with refugees. Unlike refugees, internally displaced people remain under the protection of their own government, even if their reason for fleeing was similar to that of refugees. Refugees are people who have crossed an international border to find sanctuary and have been granted refugee or refugee-like status or temporary protection.\n",
    "caveats": "Please note that most of the figures are estimates. The definition highlights two issues:\n\n1) The coercive or otherwise involuntary character of movement. The definition mentions some of the most common causes of involuntary movements, such as armed conflict, violence, human rights violations and disasters. These causes have in common that they give no choice to people but to leave their homes and deprive them of the most essential protection mechanisms, such as community networks, access to services, livelihoods. Displacement severely affects the physical, socio-economic and legal safety of people and should be systematically regarded as an indicator of potential vulnerability.\n\n2) The fact that such movement takes place within national borders. Unlike refugees, who have been deprived of the protection of their state of origin, IDPs remain legally under the protection of national authorities of their country of habitual residence. IDPs should therefore enjoy the same rights as the rest of the population. The Guiding Principles on Internal Displacement remind national authorities and other relevant actors of their responsibility to ensure that IDPs\" rights are respected and fulfilled, despite the vulnerability generated by their displacement.\n",
    "tags": [
        "conflict-violence",
        "crisis-opt-israel-hostilities",
        "displacement",
        "hxl",
        "internally displaced persons-idp"
    ],
    "resources": [
        {
            "created": "2023-12-14T02:38:55.102305",
            "description": "idmc event data for State of Palestine",
            "format": "CSV",
            "download_url": "https://data.humdata.org/dataset/a641dda7-9b19-4103-b811-76a3963d29d2/resource/759900bf-d08a-4523-8e4a-157aa97e3d29/download/event_data_pse.csv",
            "id": "759900bf-d08a-4523-8e4a-157aa97e3d29",
            "last_modified": "2025-06-10T08:22:44.752953",
            "metadata_modified": "2025-06-10T08:22:46.465349",
            "microdata": false,
            "dataset_id": "a641dda7-9b19-4103-b811-76a3963d29d2",
            "resource_type": "file.upload",
            "name": "idmc event data for PSE",
            "mimetype": null,
            "size": "56.4K"
        }
    ]
}