{"original_description_before_llm":"Arise Virtual Solutions is a business process outsourcing company that uniquely blends crowdsourcing innovation, virtual technology and operational efficiencies to deliver better results. Recognized as a work-at-home call center pioneer, Arise has been delivering services in the cloud for over 15 years through its network of over 25,000 independent work-at-home customer service, sales and technical support providers in the United States, Canada, the United Kingdom and Ireland.","description":"Arise Virtual Solutions stands as a pioneering force in the business process outsourcing sector, distinguished by its unique integration of crowdsourcing innovation, cutting-edge virtual technology, and refined operational efficiencies to consistently deliver unparalleled client outcomes.\n\nAs an established leader and recognized architect of the distributed workforce model, Arise has championed remote service delivery for over 15 years. We empower a vast, dynamic ecosystem of over 25,000 independent professionals across North America and Europe, specializing in high-caliber customer support, strategic sales, and advanced technical assistance.\n\nWe invite entrepreneurial individuals passionate about delivering exceptional service to leverage our robust, proprietary platform. Join a thriving network where your dedication directly translates into the success of leading global brands, all from the comfort and flexibility of your own professionally equipped home office. This is an unparalleled opportunity to define your own schedule, cultivate your professional growth, and contribute to a transformative model of enterprise-level service delivery within a supportive, innovation-driven environment."}
{"original_description_before_llm":"We are seeking extremely motivated and experienced individual for position of  Data Entry clerk\/Administartive Asistance\/Customer Service\/Receiptionist\/Pay roll office ..Position: Full time and part-time (30-40 hours per week Monday through Friday daytime) The position is for full-time and part-time positions available within the company.. Benefits include health, dental, vacation time, sick leave, and 401K","description":"**Operations Support Specialist**\n\nWe are actively seeking a highly motivated and experienced professional to join our dynamic team as an Operations Support Specialist. This pivotal role requires an individual with exceptional organizational acumen, a keen eye for detail, and a proactive approach to multifaceted responsibilities within a fast-paced environment.\n\n**Key Responsibilities:**\n\n*   **Information Management:** Oversee the meticulous input, validation, and maintenance of critical organizational data, ensuring unparalleled accuracy and accessibility within our proprietary systems.\n*   **Administrative Coordination:** Provide comprehensive administrative and logistical support, including advanced scheduling, precise document preparation, and professional correspondence management, to optimize daily business operations.\n*   **Client Relations & Engagement:** Serve as a primary liaison for internal and external stakeholders, delivering exceptional service and managing inquiries with professionalism, discretion, and efficiency.\n*   **Front Office Management:** Cultivate a welcoming and professional first impression, managing inbound communications, coordinating visitor experiences, and ensuring the smooth flow of front office activities.\n*   **Financial Administration Support:** Assist with the confidential processing and administration of select financial and payroll functions, maintaining strict adherence to established protocols, compliance standards, and internal controls.\n\n**Position Details:**\n\nThis opportunity offers flexible scheduling options, encompassing both full-time (40 hours\/week) and part-time (30 hours\/week) engagements, typically within standard business hours (Monday through Friday).\n\n**Benefits:**\n\nWe offer a comprehensive and competitive benefits package designed to support our employees' well-being, including robust health insurance, dental coverage, generous paid time off (vacation and sick leave), and a 401K retirement savings plan."}
{"original_description_before_llm":"Are you looking to make anywhere from 600-115,000$ a month? Are you looking to be paid to take vacations? Are you tired of working a 9-5 with no ability to grow in your field. Do you want to be your own boss and set your own schedule of when you work? If you answer yes to any of these than we have the perfect opportunity for you. Our company is based on 3 principles 1.Saving Money 2.Making Money 3.Managing Money. We offer financial soulutions to help you live financially free while making money showing others. We have over 5,800 national brand retailers where we recieve discounts.","description":"Are you seeking a distinctive professional trajectory that transcends the limitations of traditional employment? Do you aspire to a role offering unparalleled earning potential, where your initiative directly correlates with your financial success? If you envision a career path that champions entrepreneurial autonomy, empowers significant lifestyle flexibility, and cultivates sustained professional growth beyond conventional corporate frameworks, then we invite you to explore a truly transformative opportunity.\n\nOur innovative firm operates on the fundamental tenets of comprehensive financial stewardship: strategic capital preservation, dynamic wealth accumulation, and sophisticated asset management. We specialize in empowering individuals and families to achieve profound financial independence through bespoke solutions and collaborative client engagement. Our unique ecosystem leverages an expansive network of over 5,800 national brand partnerships, delivering exceptional value and proprietary benefits to our esteemed clientele.\n\nWe are actively seeking motivated individuals eager to embrace a leadership role in client development and financial empowerment. This is not merely a position; it is an invitation to build a substantial personal enterprise within a supportive, high-growth environment. You will be instrumental in guiding clients towards their financial aspirations, fostering sustainable prosperity, and expanding our impactful reach.\n\n**Key Attributes We Seek:**\n\n*   A proactive and entrepreneurial mindset with a robust drive for excellence.\n*   Exceptional communication and interpersonal acumen.\n*   A strong desire to cultivate a significant impact on others' financial well-being.\n*   Adaptability and a commitment to continuous professional development.\n\n**This Opportunity Offers:**\n\n*   Uncapped earning potential directly tied to your performance and leadership.\n*   A flexible, self-directed work schedule promoting optimal work-life integration.\n*   Comprehensive training and ongoing mentorship from industry leaders.\n*   Access to proprietary financial tools and extensive partnership networks.\n*   A pathway to develop significant personal wealth while contributing to a vital economic mission.\n\nIf you are prepared to redefine your professional landscape and embark on a fulfilling journey of financial leadership, we encourage you to submit your statement of interest. We are keen to connect with ambitious individuals ready to unlock their full potential."}
{"original_description_before_llm":"6* Ultra Luxury American Cruise Company is urgently looking for the following positions:*Hospitality - For the many Bars &amp; Restaurants on board.*Retail - For the Duty FREE Shops &amp; Boutiques on board.*housekeeping - For the Housekeeping &amp; Cleaning jobs.*Office Admin - For the Front desk &amp; Tour booking jobs*Other Positions - DJ's, Security Staff, Photographers &amp; Nannies.Vessel type or operation: 6* Ultra Luxury Cruise.Certification &amp; Experience: Previous experience (not Required)Good English speaker, Some Customer Service Skills, wanting to learn &amp; work.Job Type: Perm.Sailing Area: World wide.Benefits: On board en suite accommodation and food, Medical cover for duration of contract, world work visa, free wifi, TAX FREE Salary &amp; more!Job Description:A 6* Ultra Luxury Cruise Company are looking to recruit hardworking, enthusiastic cruise personal. This exciting opportunity is available to candidates who are willing to Learn, work &amp; are flexible.Candidate will also have Some Customer Service Skills, skills in Public Relations and are Good English speakers. Rotation is 4 months on 2 months off. Great Salary in Euros (TAX FREE) Pay is discussed via communication after full application proccess.If you are looking for a new adventure.. APPLY TODAY!Please send your resume to: #EMAIL_6e824a2834da27298c6d199e4d1829b32ca54fc0bacb0acf6d748f04fc69953b# (coppy &amp; paste this e-mail address)We will contact you shortly after within 24 hours.Looking forward to have you Aboard.Adrian WestDept. Rec.","description":"**Embark on a Distinguished Global Career with a Premier Ultra-Luxury American Cruise Line**\n\nWe are actively seeking exceptionally talented and dedicated professionals to join our esteemed team onboard a 6-star ultra-luxury fleet. As a globally renowned leader in unparalleled maritime experiences, we offer a unique opportunity to contribute to a world-class environment and deliver an extraordinary journey for our discerning guests.\n\nWe are currently recruiting for a diverse range of critical positions across our operations, including:\n\n*   **Guest Services & Culinary Operations:** Specialists across our diverse array of premium bars, fine dining establishments, and casual eateries.\n*   **Luxury Retail & Boutique Management:** Professionals to curate and manage our exclusive onboard retail experiences.\n*   **Accommodations Management & Environmental Services:** Dedicated individuals ensuring impeccable standards of guest comfort and shipboard cleanliness.\n*   **Administrative & Guest Relations Coordinators:** Front-line professionals managing comprehensive guest services, administrative functions, and bespoke excursion planning.\n*   **Entertainment & Lifestyle Curators, Maritime Security Specialists, Visual Content Professionals, and Family Services Nannies:** Experts to enrich our onboard ambiance and ensure the safety and enjoyment of all guests.\n\n**Vessel Type & Operation:** 6-Star Ultra-Luxury Cruise Liners.\n**Sailing Regions:** Global itineraries spanning diverse and exotic destinations worldwide.\n\n**Candidate Profile:**\nWhile previous cruise line experience is beneficial, we welcome applications from enthusiastic individuals with transferable skills, a strong command of English, and a genuine passion for delivering exceptional customer service. A proactive approach to continuous learning, a flexible mindset, and strong interpersonal and public relations acumen are highly valued.\n\n**Employment Type:** Permanent, full-time contracts.\n**Structured Deployment Cycles:** Enjoy an attractive rotation schedule of four months onboard, followed by two months of restorative leave.\n\n**Comprehensive Benefits Package:**\nOur commitment to our team members is reflected in our robust benefits offering, which includes:\n*   Private onboard en-suite accommodation and gourmet dining.\n*   Full medical coverage throughout your contract duration.\n*   Global mobility visa sponsorship.\n*   Complimentary high-speed Wi-Fi access.\n*   A highly competitive, tax-exempt remuneration package in Euros.\n*   And many other incentives designed to support your professional and personal well-being.\n\n**Job Description:**\nAs a leading innovator in the luxury travel sector, we are committed to recruiting hardworking and enthusiastic professionals who are eager to contribute to an unparalleled guest experience. This unparalleled opportunity is extended to individuals who embody adaptability, a strong work ethic, and an unwavering commitment to personal and professional development. Ideal candidates will possess strong communication skills, particularly in English, and a proven ability to engage positively with a diverse international clientele.\n\nIf you are ready to embark on a truly rewarding global career journey within a prestigious organization, we invite you to submit your application.\n\nTo apply for these exceptional opportunities, please forward your comprehensive resume\/CV to:\n#EMAIL_6e824a2834da27298c6d199e4d1829b32ca54fc0bacb0acf6d748f04fc69953b# (copy & paste this email address)\n\nQualified candidates will be contacted promptly for the next steps in our rigorous selection process, typically within 24-48 hours.\n\nWe look forward to welcoming exceptional talent to our esteemed fleet.\n\nSincerely,\nAdrian West\nDepartmental Recruitment Specialist"}
{"original_description_before_llm":"Responsible for assisting in the direction and administration of the planning, preparation, production and control of all culinary operations in the hotels continuing effort to deliver outstanding guest service and financial profitability.As Executive Sous Chef, you would be responsible for assisting in the direction and administration of the planning, preparation, production and control of all culinary operations in the hotel's continuing effort to deliver outstanding guest service and financial profitability. Specifically, you would be responsible for performing the following tasks to the highest standards:Assist the Executive Chef in the direction and oversight of all culinary operations, to include, but not limited to, preparation and production of all hotel meals, food quality and presentation, compliance with all safety and sanitation standards and regulation, team member productivity and performance, implementation of policies and procedures, cost controls and overall profitabilityAssist the Executive Chef by interacting with guests and clients to monitor and assess satisfaction trends, evaluate and address issues and make improvements accordinglyAssist the Executive Chef in creating and implementing menu selections for special banquet themes and events based on current food trends and regional tastes in partnership with the Executive Chef and Director of Food and Beverage, as neededEnsure compliance with federal, state, local and company health, safety, sanitation and alcohol awareness standardsMonitor and develop team member performance to include, but not limited to, providing supervision, conducting counseling and assisting with evaluations, training, scheduling and assigning work and delivering recognition and reward","description":"As a pivotal leader within our distinguished culinary division, the Executive Sous Chef strategically collaborates with the Executive Chef to meticulously orchestrate the planning, development, production, and comprehensive management of all gastronomic operations. This critical role is instrumental in ensuring the consistent delivery of an unparalleled guest experience and driving exceptional financial performance within a dynamic, world-class hospitality environment.\n\nSpecifically, the Executive Sous Chef will be entrusted with key responsibilities, demanding the highest standards of execution:\n\n*   Provide visionary oversight and direct support to the Executive Chef across all culinary functions, encompassing the meticulous preparation and presentation of diverse hotel meals, unwavering adherence to exacting food quality standards, stringent compliance with all safety and sanitation protocols, and the proactive optimization of team productivity and operational profitability.\n*   Cultivate strategic guest and client relationships, actively engaging to discern satisfaction trends, proactively address feedback, and implement enhancements that elevate the dining experience to new heights.\n*   Champion culinary innovation by contributing to the conceptualization and execution of bespoke menu selections for premier banquets and events, drawing upon cutting-edge food trends and refined regional palates in close collaboration with the Executive Chef and Director of Food and Beverage.\n*   Uphold and enforce the most rigorous federal, state, local, and company health, safety, sanitation, and alcohol awareness standards, fostering a culture of uncompromising compliance and operational excellence.\n*   Lead the comprehensive development and mentorship of culinary team members, encompassing strategic supervision, performance coaching, evaluation support, advanced training initiatives, judicious scheduling, work assignment optimization, and the cultivation of a robust recognition and reward framework."}
{"original_description_before_llm":"Corporate overviewAker Solutions is a global provider of products, systems and services to the oil and gas industry. Our engineering, design and technology bring discoveries into production and maximize recovery from each petroleum field. We employ approximately 28,000 people in about 30 countries. Go to #URL_0fa3f7c5e23a16de16a841e368006cae916884407d90b154dfef3976483a71ae# for more information on our business, people and values.We are looking for individuals who are prepared to take a position. Not only a position within Aker Solutions, but also a position on the exciting challenges the global oil and gas industry faces now and in the futureAker Solutions are looking to recruit a Project Subcontracting Manager to be based in their Houston office, USA.We are currently expanding and we need new talents who can strengthen our team and support our ambitious plans within the subsea market.Responsibilities and tasks- Overall responsibility for management of the Joint Venture (JV) its contracts ie. management of subcontracts and own fabrication and test activities at service base in the country\/region of execution. - Promote HSE and quality mindset, on-time delivery, co-operation, proactive- and resolution oriented mindset and continuous improvement. - To participate in the project from System Definition phase and heavily engaged during Detailing &amp; Fabrication, Assembly and Integration test phases. - Is part of the Project Management Team and is jointly accountable for achieving the project objectives (budget, scope, time schedule and quality).Execution overall - Managing all resources being part of the JV as well as all subcontracting\/site teams- Participate on Tender teams when bidding on new SPS \/ MSP projects - Review ITT and determine client requirements for Local content and hence subcontracting- Establish project specific Terms &amp; Conditions for Purchase Orders to subcontractors when required, including LCI requirements- Prepare and negotiate any MOU and contracts with potential partners\/subcontractors\/local suppliers as part of BD\/tendering activities and as part of project execution- Reviewing and analysing subcontractors\/local supplier quotations as required- Managing the contracts towards local suppliers\/subcontractors wrt scope, time, cost and qualityExecution at site(s);- Ensure timely delivery from product areas deliveries, including engineering documents and HW for local content execution- Ensure timely handling of any deviations- Is authorized to take and implement necessary decisions to ensure efficient performance construction and testing - Ensure mechanical completion on site- Ensure development of final documentation- Coordinate on site to facilitate for system integration testing (SIT)- Ensure required tooling is available for testing - Ensure SLS (local service base) participation in the project from System Definition phase including a proper handover- Ensure proper tidying up and handling of the test EQ, remained stock at site at the end of the project Scope Management- Report to the Project Management Core Team on any contractual or commercial issues related to sub-contractors- Prepare a list of necessary commercial and contractual qualifications for inclusion in tenders\/projects for subcontract amendments or variation- Ensure that the fabrication is in accordance with the design- Assist in claims management and claims resolutionTime Management- Coordinate supplies to site (CPI\/free issued items), fabrication and testing activities- Overlook fabrication, manufacturing and testing activities to ensure timely deliveriesQuality Management- Review quality plans for internal and subcontracted fabrication and follow up fabrication sites for proper implementation Communication Management- Ensure efficient communication between the project and manufacturing sites- Report progress on construction, fabrication and testing activitiesHSE Management- Provide feedback and supervise HSE plans since early in the project- Coordinate and monitor HSE requirements during construction and testing to ensure top HSE standards- Ensure on site HSE activities\/actions (participate and document SJA, regular and ad-hoc inspections, train SIT team, handle SIT \"visitors\", get photo permissions for SIT resources etc)Corporate overviewAker Solutions is a global provider of products, systems and services to the oil and gas industry. Our engineering, design and technology bring discoveries into production and maximize recovery from each petroleum field. We employ approximately 28,000 people in about 30 countries. Go to #URL_0fa3f7c5e23a16de16a841e368006cae916884407d90b154dfef3976483a71ae# for more information on our business, people and values.We are looking for individuals who are prepared to take a position. Not only a position within Aker Solutions, but also a position on the exciting challenges the global oil and gas industry faces now and in the futureAker Solutions are looking to recruit a Project Subcontracting Manager to be based in their Houston office, USA.We are currently expanding and we need new talents who can strengthen our team and support our ambitious plans within the subsea market.Responsibilities and tasks- Overall responsibility for management of the Joint Venture (JV) its contracts ie. management of subcontracts and own fabrication and test activities at service base in the country\/region of execution. - Promote HSE and quality mindset, on-time delivery, co-operation, proactive- and resolution oriented mindset and continuous improvement. - To participate in the project from System Definition phase and heavily engaged during Detailing &amp; Fabrication, Assembly and Integration test phases. - Is part of the Project Management Team and is jointly accountable for achieving the project objectives (budget, scope, time schedule and quality).Execution overall - Managing all resources being part of the JV as well as all subcontracting\/site teams- Participate on Tender teams when bidding on new SPS \/ MSP projects - Review ITT and determine client requirements for Local content and hence subcontracting- Establish project specific Terms &amp; Conditions for Purchase Orders to subcontractors when required, including LCI requirements- Prepare and negotiate any MOU and contracts with potential partners\/subcontractors\/local suppliers as part of BD\/tendering activities and as part of project execution- Reviewing and analysing subcontractors\/local supplier quotations as required- Managing the contracts towards local suppliers\/subcontractors wrt scope, time, cost and qualityExecution at site(s);- Ensure timely delivery from product areas deliveries, including engineering documents and HW for local content execution- Ensure timely handling of any deviations- Is authorized to take and implement necessary decisions to ensure efficient performance construction and testing - Ensure mechanical completion on site- Ensure development of final documentation- Coordinate on site to facilitate for system integration testing (SIT)- Ensure required tooling is available for testing - Ensure SLS (local service base) participation in the project from System Definition phase including a proper handover- Ensure proper tidying up and handling of the test EQ, remained stock at site at the end of the project Scope Management- Report to the Project Management Core Team on any contractual or commercial issues related to sub-contractors- Prepare a list of necessary commercial and contractual qualifications for inclusion in tenders\/projects for subcontract amendments or variation- Ensure that the fabrication is in accordance with the design- Assist in claims management and claims resolutionTime Management- Coordinate supplies to site (CPI\/free issued items), fabrication and testing activities- Overlook fabrication, manufacturing and testing activities to ensure timely deliveriesQuality Management- Review quality plans for internal and subcontracted fabrication and follow up fabrication sites for proper implementation Communication Management- Ensure efficient communication between the project and manufacturing sites- Report progress on construction, fabrication and testing activitiesHSE Management- Provide feedback and supervise HSE plans since early in the project- Coordinate and monitor HSE requirements during construction and testing to ensure top HSE standards- Ensure on site HSE activities\/actions (participate and document SJA, regular and ad-hoc inspections, train SIT team, handle SIT \"visitors\", get photo permissions for SIT resources etc)","description":"**Aker Solutions: Pioneering Excellence in Global Energy Solutions**\n\nAker Solutions stands as a preeminent global leader, delivering cutting-edge products, sophisticated systems, and comprehensive services to the dynamic oil and gas industry. Our unwavering commitment to engineering innovation, advanced design methodologies, and proprietary technology propels new discoveries into robust production, consistently maximizing recovery from vital petroleum fields worldwide. With a formidable global presence, encompassing approximately 28,000 dedicated professionals across 30 countries, we are at the forefront of shaping the future of energy.\n\nWe are actively seeking visionary individuals poised to embrace a pivotal role. More than just a position within Aker Solutions, we invite you to take a definitive stand on the complex and exhilarating challenges confronting the global oil and gas sector, both today and in the decades to come.\n\n**Opportunity: Project Subcontracting Manager**\n**Location:** Houston Office, USA\n\nAs part of our strategic global expansion and ambitious growth trajectory within the evolving subsea market, Aker Solutions is keen to onboard exceptional talent to augment our high-performing team. This is an unparalleled opportunity for a seasoned professional to significantly contribute to our strategic imperatives.\n\n**Role Mandate:**\n\nThe Project Subcontracting Manager will assume critical stewardship over multifaceted joint ventures and complex contractual frameworks, orchestrating a spectrum of activities from sophisticated subcontract management to specialized fabrication and rigorous testing operations within diverse execution environments. This role demands a profound commitment to fostering a culture of operational excellence, continuous improvement, and unwavering adherence to the highest standards of safety and quality.\n\n**Key Responsibilities and Strategic Contributions:**\n\n*   **Strategic Oversight & Execution:** Provide overarching leadership for the successful delivery of joint venture projects, ensuring seamless integration of subcontracted activities and proprietary fabrication processes.\n*   **Performance & Culture Catalyst:** Champion an exemplary HSE and quality mindset, driving on-time delivery, fostering collaborative synergies, and instilling a proactive, resolution-oriented approach across all project phases.\n*   **Project Lifecycle Engagement:** Influence project outcomes from the foundational System Definition phase, maintaining deep engagement through Detailing, Fabrication, Assembly, and rigorous Integration Test phases.\n*   **Leadership Team Integration:** Serve as an integral member of the Project Management Team, sharing joint accountability for the attainment of ambitious project objectives, including budgetary adherence, scope integrity, schedule optimization, and uncompromising quality standards.\n*   **Resource & Team Orchestration:** Strategically manage all deployed resources within joint ventures and oversee multi-disciplinary subcontracting and site teams, optimizing operational efficiencies.\n*   **Tender & Bid Strategy:** Contribute actively to tender teams, meticulously analyzing Invitation To Tender (ITT) documents to strategically align with client requirements for local content and comprehensive subcontracting.\n*   **Contractual Framework Development:** Formulate and negotiate intricate Memoranda of Understanding (MOUs) and definitive contracts with prospective partners, subcontractors, and local suppliers, as an intrinsic part of business development, tendering, and project execution.\n*   **Commercial & Financial Acumen:** Conduct astute review and meticulous analysis of subcontractor and local supplier quotations, ensuring optimal commercial terms and value alignment.\n*   **Holistic Contract Management:** Exercise comprehensive contract lifecycle management with local suppliers and subcontractors, meticulously governing scope, schedule, cost, and quality parameters.\n*   **Supply Chain Integration & On-Site Excellence:**\n    *   Ensure the timely and precise delivery of critical product area components, including engineering documentation and hardware, for local content execution.\n    *   Proactively identify and agilely resolve any project deviations or anomalies.\n    *   Exercise empowered decision-making to optimize performance during construction and testing phases, driving efficiency and excellence.\n    *   Verify mechanical completion at site, ensuring adherence to stringent specifications.\n    *   Oversee the meticulous development of final project documentation.\n    *   Orchestrate on-site activities to facilitate sophisticated system integration testing (SIT).\n    *   Ensure the immediate availability of all requisite tooling for testing protocols.\n    *   Guarantee the full participation of the local service base (SLS) from System Definition, ensuring seamless knowledge transfer and operational handover.\n    *   Oversee the systematic organization and handling of test equipment and remaining stock at project conclusion.\n*   **Scope & Commercial Governance:**\n    *   Provide incisive reporting to the Project Management Core Team on all pertinent contractual or commercial issues related to subcontractors.\n    *   Curate and present comprehensive lists of necessary commercial and contractual qualifications for inclusion in tenders or projects for subcontract amendments or variations.\n    *   Validate that all fabrication aligns precisely with the approved design specifications.\n    *   Provide expert assistance in complex claims management and dispute resolution.\n*   **Time & Schedule Optimization:**\n    *   Coordinate the intricate logistics of site supplies, free-issued items, and meticulously plan fabrication and testing activities to maintain critical path integrity.\n    *   Provide strategic oversight to all fabrication, manufacturing, and testing activities, ensuring timely deliveries and adherence to master schedules.\n*   **Quality Assurance Leadership:**\n    *   Conduct rigorous reviews of quality plans for both internal and subcontracted fabrication, meticulously following up with fabrication sites to ensure impeccable implementation of quality protocols.\n*   **Communication & Reporting Excellence:**\n    *   Cultivate and ensure highly efficient communication channels between the project teams and manufacturing sites globally.\n    *   Deliver precise and timely progress reports on all construction, fabrication, and testing activities to key stakeholders.\n*   **HSE Stewardship:**\n    *   Provide invaluable feedback and expert supervision on HSE plans from the nascent stages of project initiation.\n    *   Coordinate and rigorously monitor HSE requirements during construction and testing phases, ensuring the consistent attainment of exemplary HSE standards.\n    *   Oversee and document all on-site HSE activities, including but not limited to participation in Job Safety Analysis (JSAs), regular and ad-hoc inspections, comprehensive training for the SIT team, meticulous handling of SIT visitors, and securing photo permissions for SIT resources.\n\nThis role offers a unique opportunity to shape significant global projects within a forward-thinking organization, providing an environment for unparalleled professional growth and impact."}
{"original_description_before_llm":"Hundreds of Freelance Jobs available every month for freelance designers, developers, writers and bloggers. Part of SaudiLancer - the most popular Freelance Blog and Community online | #URL_a0fb001321b0fff947b0a19a393a8a3387585f345c45c7d54fa7ff492852e0b4# URL: www.#URL_a0fb001321b0fff947b0a19a393a8a3387585f345c45c7d54fa7ff492852e0b4# ","description":"**Premier Freelance Collaboration Opportunities**\n\nWe are actively seeking highly skilled and ambitious independent professionals to join our expansive global network. A continuous, high-volume flow of meticulously curated project engagements is made available monthly for accomplished experts across:\n\n*   **Digital Design & Visual Communication**\n*   **Software Development & Engineering**\n*   **Strategic Content Creation**\n*   **Digital Publishing & Media Strategy**\n\nThese exceptional opportunities are facilitated through our strategic affiliation with SaudiLancer, globally recognized as a premier digital ecosystem and vibrant community for independent talent. Partnering with us offers unparalleled professional autonomy, access to a dynamic global network, and the chance to contribute to diverse, impactful initiatives that drive significant career evolution.\n\nElevate your professional trajectory within a supportive, high-performance environment designed for leading independent professionals. Discover an unprecedented scope of engagement possibilities and unlock your full potential."}
{"original_description_before_llm":"A Variety of Commission based jobs available.Visit: #URL_0a7c4df3a2fd5dd5a67beb9cf6c0ba4f8d53ae8372db9449011f37a9deaf7e64#","description":"**Revenue Growth Executive - Performance-Based**\n\nAre you an exceptionally driven and results-oriented professional with a proven track record in cultivating strategic client relationships and accelerating revenue generation? We are actively seeking ambitious individuals to join our dynamic team as Revenue Growth Executives. This is a unique opportunity to apply your strategic acumen and entrepreneurial spirit within a progressive organization poised for significant expansion, offering an unparalleled pathway to financial reward.\n\nIn this pivotal role, you will be instrumental in identifying, developing, and nurturing high-value partnerships across diverse market segments. Your responsibilities will encompass comprehensive market analysis, strategic outreach initiatives, the presentation of our cutting-edge solutions, and the negotiation of mutually beneficial agreements. You will directly contribute to our organizational growth objectives by expanding our market footprint and enhancing client engagement.\n\nWe offer a highly competitive, performance-based compensation model designed to generously reward your achievements with uncapped earning potential. This position provides substantial autonomy, flexible working arrangements, and robust professional development resources within a supportive, collaborative, and results-driven environment. If you are a proactive self-starter with a relentless drive for success and a desire to be a key contributor in a rapidly evolving industry, we encourage you to explore this highly rewarding opportunity.\n\n**Qualifications:**\n*   Demonstrated expertise in sales, business development, or strategic client relations.\n*   Exceptional verbal and written communication, negotiation, and presentation skills.\n*   A strong entrepreneurial mindset with a proactive, target-driven approach.\n*   Ability to work independently while effectively leveraging team resources.\n*   Proven capacity for strategic thinking and complex problem-solving.\n\n**Benefits:**\n*   Highly lucrative, uncapped commission structure.\n*   Flexible work schedule and location options.\n*   Ongoing professional development and advanced training programs.\n*   Significant opportunities for rapid career advancement and leadership.\n*   Access to innovative tools and a network of industry experts.\n\nTo express your interest, please submit a comprehensive resume along with a concise cover letter detailing your relevant experience and outlining your strategic vision for contributing to a performance-based role."}
{"original_description_before_llm":"Part Time Staff Needed, Weekend Cash Job.You can do it all from home, in your free time, at your own place.Spend 30 minutes or 1 hours a day &amp; Get biggest cash.You can work in the morning, afternoon, or at night.Perfect for everyone then start immediately.Can earn $400 to $450 extra per day.No any experience required.Zero start-up fee, Visit here:-#URL_7ebe37f71633be1b80547d6f213cb0075a63b6ced35281bfa5c067b5c685f04c#-rg.info","description":"**Part-Time Remote Operational Support Specialist**\n\nWe are actively seeking highly motivated and detail-oriented individuals to join our dynamic team as a Part-Time Remote Operational Support Specialist. This unique opportunity offers exceptional flexibility, allowing you to seamlessly integrate professional contributions into your personal schedule from any location.\n\n**Key Responsibilities:**\n*   Facilitate efficient information management and data coordination.\n*   Provide crucial administrative assistance to optimize daily operations.\n*   Contribute to project-based initiatives and ensure timely execution.\n*   Maintain accurate records and support streamlined communication channels.\n\n**What We Offer:**\n*   Unparalleled autonomy and the flexibility to set your own hours, accommodating diverse lifestyles.\n*   A stimulating remote work environment that fosters productivity and independence.\n*   Access to comprehensive training and development resources, ensuring your success regardless of prior experience.\n*   Competitive, performance-based compensation that recognizes and rewards efficient output.\n*   Opportunities for rapid engagement and immediate contribution within a supportive framework.\n\nThis role is ideal for resourceful individuals looking to leverage their organizational skills and commitment to achieve significant supplementary income. We pride ourselves on an expedited onboarding process for qualified candidates.\n\n**To Apply:** Submit your expression of interest through our dedicated online portal."}
{"original_description_before_llm":"We have several openings available in this area earning $1000.00-$2500.00 per week. We are seeking only honest, self-motivated people with a desire to work in the home typing and data entry field, from the comfort of their own homes.The preferred applicants should be at least 18 years old with Internet access. No experience is needed. However the following skills are desirable:  ","description":"We are actively seeking dedicated and meticulous Virtual Information Specialists to join our expanding remote operations. This exceptional opportunity offers the flexibility of working from your home environment, contributing to vital data initiatives, and participating in a performance-driven compensation model with the potential for weekly earnings ranging from $1,000 to $2,500, commensurate with productivity and accuracy.\n\nAs a key contributor, you will be responsible for precise digital content processing, information management, and ensuring the integrity of critical organizational data. We are looking for highly self-motivated individuals with a strong work ethic and an unwavering commitment to detail.\n\nIdeal candidates should possess reliable high-speed internet access and a proficient understanding of common digital platforms. While comprehensive onboarding and continuous training will be provided to ensure your success, a background in administrative support, data processing, or related fields is considered beneficial. Applicants must be at least 18 years of age.\n\nIf you are a results-oriented professional eager to leverage your organizational skills in a flexible and rewarding capacity, we encourage you to apply."}
{"original_description_before_llm":"Job Responsibilities:* Start-up, operate and shutdown mechanical, and electrical equipment to meet contract and business plan requirements.* Manually operate valves, pumps, dampers, and other equipment as necessary.* Perform switching of electrical equipment up to 230 kV.* Perform operations to place electrical circuits and generating equipment in and out of service.* Monitor equipment for proper operation and make adjustments as required.* Diagnose equipment problems and identify abnormal conditions.* Respond calmly to emergency situations and take corrective action to operate equipment within safe limits and good industry practice.\u2028* Determining the operating status of equipment from previous shift personnel, logbook entries, visual inspection of records, indicating instruments, and by local inspection.\u2028* Direct the activities of the Operator Mechanic 2(s) in the day to day operation and maintenance of the plant.* Coordinate plant operations with steam and\/or electricity customer, independent system operator or scheduler.* Coordinate and\/or nominate fuel with supplier.* Perform safety related duties including determining and applying equipment isolation schedules for lock out\/tag out procedures, monitoring of confined spaces, monitoring hot work permits, inspecting excavations, monitoring of barricaded areas and performing PPE assessments.* Perform other safety related duties as required to maintain a safe work environment.* Write and maintain equipment logs, procedures, timesheets, expense reports and other documentation as required.* Maintain drawings, specifications, test logs and other records. Read, understand and respond to written instructions and logbook notations.* Check e-mail, public folders, acknowledgements of information and other electronic or computer generated documents.* Responsible for troubleshooting, diagnosing, procuring parts and performing repairs on equipment.* Maintain tool inventories and supplies to perform such tasks.\u2028* Participate in daily preventive, planned and breakdown maintenance activities in a safe, effective and timely manner.* Inspect service, calibrate, and maintain automated control systems and instrumentation.\u2028* Perform general electrical maintenance such as field wiring and locating and correcting electrical grounds.* Disassemble, repair, and reassemble mechanical and electrical equipment.* Connect and disconnect AC and DC motors. * Thread and bend conduits and tubing.* Service brushes on rotating electrical equipment.* Pull cable, check phasing and terminates connections.* Assist others with management of change by gathering data, performing diagnostic tests, installing software or hardware changes, perform new equipment installations, and plant improvements.* Provides recommendations to maintain and improve equipment performance.\u2028* Collect data and perform other tasks associated with Reliability Based Maintenance program.* Perform routine equipment lubrication schedules.\u2028* Handle, store and dispense hazardous substances.* Monitor hazardous material accumulation sites, label containers, observe hazardous waste storage areas for unusual occurrences and maintain areas in a clean and orderly fashion.* Respond to accidents, fires and other emergencies in accordance with established procedures.* May be required to assist in fighting fires within the facility with hand-held fire extinguishers.* Tutor, train, instruct, and assist other personnel as required.* Maintain own knowledge and skill levels current for equipment, tooling and other change demands.* Function as leader or member of strategic, implementation, and improvement team.\u2028* Perform housekeeping activities that include sweeping, dusting, picking up refuse, wiping down equipment, and hosing down areas of the plant.\u2028* Direct and monitor contractor activities.* Travel for training and\/or other company business.* Operate a company vehicle, forklift, and other mobile equipment.","description":"**Job Responsibilities:**\n\n*   **Operational Leadership:** Oversee the precise activation, continuous operational management, and systematic deactivation of complex mechanical and electrical systems, ensuring unwavering alignment with strategic contractual obligations and robust business objectives.\n*   **System Optimization:** Execute the controlled manipulation of critical process components, including valves, pumps, and dampers, to optimize system performance and maintain unparalleled operational integrity.\n*   **High-Voltage Management:** Conduct high-voltage electrical switching operations (up to 230 kV) with meticulous adherence to stringent safety protocols and peak operational efficiency standards. Manage the strategic integration and de-integration of electrical circuits and power generation assets within the dynamic operational grid.\n*   **Performance Monitoring & Diagnostics:** Continuously evaluate intricate system performance parameters, implementing real-time adjustments to ensure optimal functionality and drive proactive, predictive maintenance. Apply advanced diagnostic techniques to identify and resolve complex equipment malfunctions and emergent operational anomalies, safeguarding uninterrupted performance.\n*   **Emergency Response & Crisis Management:** Demonstrate exceptional composure and decisive action during high-pressure emergency scenarios, implementing critical corrective measures to uphold stringent safety limits and industry best practices. Lead immediate and effective responses to critical incidents, including accidents and fires, strictly adhering to advanced emergency protocols and contributing to initial rapid-response fire suppression efforts utilizing specialized portable equipment.\n*   **Strategic Handoff & Analysis:** Synthesize comprehensive operational insights by analyzing prior shift reports, meticulous logbook documentation, sophisticated instrumentation readings, and thorough on-site inspections.\n*   **Team Leadership & Development:** Provide expert guidance and direct the execution of daily operational and maintenance activities for a team of skilled Operator Mechanics, fostering a culture of excellence, efficiency, and continuous professional growth. Serve as a mentor and subject matter expert, providing comprehensive training, instruction, and guidance to junior personnel.\n*   **Stakeholder Coordination:** Serve as a pivotal liaison, orchestrating seamless operational coordination with key stakeholders, including strategic customers, independent system operators, and scheduling entities. Manage the strategic nomination and procurement of fuel resources in close collaboration with external suppliers, optimizing supply chain logistics.\n*   **Safety & Compliance Champion:** Champion a proactive safety culture by meticulously developing and enforcing robust equipment isolation protocols (LOTO), diligently overseeing confined space operations, validating hot work permits, inspecting excavation sites, monitoring controlled access zones, and conducting comprehensive Personal Protective Equipment (PPE) assessments. Continuously identify and implement advanced safety measures to cultivate an exceptionally secure operational environment. Ensure the compliant and secure handling, storage, and controlled dispensation of hazardous substances, adhering to all regulatory mandates. Oversee the diligent monitoring and meticulous management of hazardous material accumulation points, ensuring precise labeling, proactive identification of anomalies within waste storage facilities, and maintaining impeccable site integrity.\n*   **Rigorous Documentation & Information Management:** Maintain rigorous documentation standards, encompassing comprehensive equipment logs, procedural guidelines, personnel time records, and financial expenditure reports, ensuring meticulous data integrity. Manage and interpret a vast repository of technical documentation, including engineering drawings, precise specifications, and detailed test logs, responding adeptly to complex written directives and operational notations. Leverage digital communication platforms and sophisticated information management systems to facilitate seamless data exchange and operational updates.\n*   **Asset Lifecycle Management:** Assume full accountability for the holistic lifecycle management of critical assets, encompassing advanced troubleshooting, precise diagnostics, strategic component procurement, and meticulous equipment restoration. Oversee the optimization and systematic management of specialized tool and supply inventories to ensure continuous operational readiness.\n*   **Advanced Maintenance Execution:** Actively engage in, and lead initiatives for, robust preventive, planned, and rapid-response maintenance, strictly adhering to stringent safety protocols and efficiency benchmarks. Conduct precise inspection, servicing, and calibration of sophisticated automated control systems and highly sensitive instrumentation, ensuring peak operational accuracy. Execute expert electrical maintenance tasks, including intricate field wiring and advanced fault isolation for electrical grounding systems. Master the intricate processes of mechanical and electrical equipment disassembly, precision repair, and reassembly to exacting specifications. Manage the secure and efficient integration and de-integration of AC and DC motor systems. Exhibit proficiency in the precise threading and forming of conduits and tubing for complex infrastructure installations. Perform critical maintenance on rotating electrical machinery, specializing in brush system optimization. Orchestrate the strategic routing, meticulous phasing verification, and secure termination of complex cabling networks. Implement and manage systematic lubrication protocols to extend asset lifespan and optimize operational efficiency.\n*   **Change Management & Improvement:** Facilitate pivotal contributions to organizational change management initiatives, including comprehensive data acquisition, advanced diagnostic testing, seamless software\/hardware integrations, strategic new equipment deployments, and overall plant optimization projects. Formulate and present strategic recommendations for continuous enhancement of equipment performance and reliability. Spearhead data collection and analytical activities integral to the sophisticated Reliability-Centered Maintenance (RCM) framework.\n*   **Operational Excellence & Stewardship:** Uphold stringent standards of operational cleanliness and environmental stewardship, overseeing comprehensive facility sanitation protocols and ensuring immaculate conditions across all plant areas.\n*   **Contractor Management:** Provide expert oversight and strategic direction to external contractors, ensuring seamless project execution and adherence to organizational standards.\n*   **Professional Development & Strategic Mobility:** Commit to continuous professional development, proactively acquiring and maintaining cutting-edge knowledge and advanced competencies pertaining to evolving equipment, innovative tooling, and dynamic industry shifts. Assume pivotal leadership or integral team member roles within high-impact strategic planning, implementation, and continuous improvement initiatives. Engage in essential business travel for advanced professional development and strategic corporate engagements.\n*   **Equipment Operation:** Operate a diverse fleet of company vehicles and specialized mobile equipment, including forklifts, with exceptional proficiency and strict adherence to safety regulations."}
{"original_description_before_llm":"Are you looking to make anywhere from 600-115,000$ a month? Are you looking to be paid to take vacations? Are you tired of working a 9-5 with no ability to grow in your field. Do you want to be your own boss and set your own schedule of when you work? If you answer yes to any of these than we have the perfect opportunity for you. Our company is based on 3 principles 1.Saving Money 2.Making Money 3.Managing Money. We offer financial soulutions to help you live financially free while making money showing others. We have over 5,800 national brand retailers where we recieve discounts.","description":"**Strategic Financial Development Associate**\n\nAre you an ambitious professional seeking a transformative career opportunity where your drive directly shapes your success and lifestyle? We invite you to explore a path beyond conventional employment, one offering unparalleled autonomy, a clear trajectory for significant professional growth, and the ability to dictate your own working paradigm.\n\nOur innovative organization is founded on core principles centered around holistic financial empowerment: **Strategic Wealth Accumulation, Prudent Asset Management, and Optimized Expense Reduction.** We are dedicated to equipping individuals with the knowledge and tools to achieve enduring financial independence.\n\nAs a Strategic Financial Development Associate, you will be instrumental in expanding our reach, guiding new clients through our proprietary financial frameworks, and cultivating a robust network. This involves consultative engagement, market development, and fostering long-term relationships built on value and trust. Your role will be pivotal in translating complex financial concepts into actionable strategies for our diverse client base.\n\nWe distinguish ourselves through a unique value proposition, including exclusive strategic alliances with over 5,800 national brand retailers, providing exceptional benefits and opportunities within our ecosystem.\n\nThis performance-based role offers an exceptional, uncapped income potential, recognizing your direct contribution to our shared growth. If you are prepared to redefine your professional boundaries and cultivate a truly rewarding career, we encourage you to connect with us."}
{"original_description_before_llm":"Real Estate, Mortgage &amp; Insurance Professionals, ELITE Realty Services is opening 3 offices every 60 days in CA and we are expanding; there are Ownership opportunities nationwide. Our 3 x 3 business model is revolutionary review this 22 minute video #URL_260173b96e416838e3822d278c8f758694fa3c712473878f4d063ad0a61f5dcd# ERS also has Broker &amp; Branch Manager opportunities in your State.","description":"For esteemed professionals in the Real Estate, Mortgage, and Insurance sectors, ELITE Realty Services is embarking on an unprecedented strategic expansion initiative. In response to robust market demand, we are establishing multiple new market centers across California at an accelerated pace, reflecting our dynamic growth trajectory.\n\nThis ambitious national expansion creates unparalleled entrepreneurial partnership opportunities for visionary leaders nationwide. Central to our success is our distinctive, proprietary business paradigm, meticulously engineered to redefine industry standards and foster exponential growth for our partners.\n\nBeyond these significant ownership pathways, we are also actively seeking accomplished leaders for pivotal State Broker and Branch Manager roles within key markets. We invite highly motivated individuals, eager to leverage their expertise and drive substantial regional impact, to explore these exceptional career prospects.\n\nIf you are prepared to contribute to a rapidly expanding, innovative enterprise and aspire to a role with profound influence and equity potential, we encourage you to submit your detailed professional profile for confidential consideration."}
{"original_description_before_llm":"We are looking for top ranked Technical Recruiters to join our network of trusted Recruiting &amp; Talent Acquisition Professionals. Approved members of the network will be ranked and reviewed by previous Hiring Managers and\/or candidates of whom they have placed, providing transparency and regulation to the talent acquisition process.  Upon Approval, Recruiters will be listed on the network outlining your strengths, geographical preferences and area of focus and will then be paired up with Startup, VCs and Hiring Companies\/Managers who are looking to build a Technical Team comprised of talent suited for your areas of expertise. Candidates will also be referred to, and paired with networked Recruiters whom demonstrate skill-sets, experience and career goals aligning with Recruiters area of expertise  Both Recruiters &amp; Hiring Managers will be granted access to the ATS (Applicant Tracking System) for easy collaboration, review of notes and progress on potential candidates.Recruiters are equipped with cutting edge technology, continued training &amp; education, assessment tools and sourcing subscriptions so they may execute effectively &amp; efficiently and also collaborate with other networked recruiters, maximizing talent reach.   Our proven, science-based predictive hiring analysis and video interviewing platform will also be granted to Recruiters as part of their toolbox and will be a part of the talent acquisition workflow.  All intelligence gather will then be presented to the Hiring Manager as part of the Candidate Profile and all represented candidates are backed by our 100% Candidate Guarantee. Every placement. Every time.    ","description":"We are seeking to integrate exceptional Technical Recruiters into our esteemed, peer-reviewed professional ecosystem of Talent Acquisition specialists. Successful candidates will be inducted into a highly selective network, distinguished by a meticulous vetting process and ongoing performance validation from both hiring executives and placed professionals, ensuring unparalleled transparency and principled governance within the talent acquisition lifecycle.\n\nUpon formal induction, network Associates will be prominently featured within our curated directory, showcasing their unique strengths, geographic proficiencies, and specialized domain expertise. This strategic profiling facilitates bespoke connections with pioneering startups, venture capital firms, and established enterprises actively seeking to assemble high-performing technical teams perfectly aligned with our Associates' capabilities. Furthermore, discerning candidates are strategically aligned with network Recruiters whose skill sets, experience, and career aspirations resonate with their areas of specialization.\n\nBoth Recruiters and Hiring Managers are granted privileged access to our advanced, integrated talent orchestration platform, designed for seamless collaboration, comprehensive note review, and real-time progress tracking of prospective candidates. Networked Recruiters are empowered with unfettered access to a suite of advanced proprietary tools, continuous professional development modules, premium assessment instruments, and comprehensive sourcing intelligence subscriptions, enabling them to execute effectively, efficiently, and to foster dynamic collaboration across the network, thereby maximizing talent reach. Our groundbreaking, empirically validated predictive analytics engine and integrated video interviewing platform are integral components of every Associate's professional toolkit, streamlining the talent acquisition workflow. All gathered intelligence is meticulously compiled into robust Candidate Profiles for presentation to Hiring Managers, underpinned by our unequivocal Candidate Performance Assurance, ensuring unparalleled confidence in every strategic placement."}
{"original_description_before_llm":"Experienced, reliable team members are needed for our Data Entry Clerk \/ Administrative Assistant needed! We are currently searching for candidates with previous experience and\/or motivated quick learners. These positions require a friendly phone personality, great attention to detail and the ability to work quickly and efficiently. This is a customer contact position that requires patience, a great phone demeanor, excellent verbal and written communications, and reliable work attendance.Key Aspects of Position:Provide extraordinary service to our customers at all times.Work as part of a Customer Service team.Other duties as assigned.","description":"**Client Relations & Operations Coordinator**\n\nJoin a forward-thinking and rapidly expanding organization where your contributions are vital to our continued success. We are actively seeking a highly meticulous and exceptionally proactive professional to fill the pivotal role of Client Relations & Operations Coordinator. This position offers a unique opportunity to become an integral part of a dynamic team, directly influencing our operational efficiency and client satisfaction.\n\n**Key Responsibilities:**\n\n*   Cultivate and maintain exemplary client relationships through sophisticated multi-channel communication, ensuring a consistently superior service experience.\n*   Execute precise information management, comprehensive data verification, and diligent record maintenance to uphold the integrity and accessibility of critical operational data.\n*   Collaborate seamlessly within a high-performing cross-functional team, contributing to the optimization of workflows and enhancement of service delivery protocols.\n*   Serve as a primary point of contact for client inquiries, demonstrating exceptional problem-solving acumen and a proactive, solutions-oriented approach to resolution.\n*   Contribute to diverse ad-hoc projects and strategic initiatives, supporting broader organizational objectives and process refinements.\n\n**Desired Qualifications:**\n\n*   Proven experience in administrative support, information management, or client relations roles is highly valued, though a demonstrated aptitude for rapid learning and adaptability will be equally considered.\n*   Exceptional verbal and written communication skills, coupled with a refined telephone presence and an unwavering professional demeanor.\n*   Meticulous attention to detail and a profound commitment to accuracy in all tasks.\n*   Superior organizational capabilities and the capacity to manage multiple priorities efficiently within a fast-paced, evolving environment.\n*   A strong sense of personal accountability and a dedication to consistent, reliable performance.\n\nThis role represents an unparalleled opportunity for a highly motivated individual eager to make a tangible impact and grow within a supportive, results-driven culture. We offer competitive compensation and a comprehensive benefits package, alongside significant avenues for professional development and advancement."}
{"original_description_before_llm":"Apply using below link#URL_6b17ba83c57b72435e038d16661093cf81906cebb797073ad6e575dfa379ac1d#Bristol Hospital in Bristol CT has an exciting opportunity for an Operations Manager in our Perioperative Center servicing Ambulatory Surgery and Endoscopy. The ideal candidate will oversee the safe care of patients as they process through admissions, endoscopy procedures and Phase 2 recovery. Will also collaborate with Perioperative Services Leadership on daily workflow issues and implement solutions; develop and maintain educational calendar and strategies, facilitate staff education\/competency; select, develop, oversee and evaluate direct reports; develop and oversee financial manaagement of the department including the operating budget, supplies, equipment, space, staff and information; develop and utilize key performance indicators for trending and identifying areas of improvement. The Operations Manager will also be responsible for compliance with government and agency regulations and be knowledgeable of and comply with all applicable infection control, health and safety policies and procedures as implemented by the department.","description":"Bristol Hospital, a renowned leader in patient-centric healthcare innovation, is actively seeking a visionary and results-oriented Operations Manager to lead our dynamic Perioperative Center, encompassing both Ambulatory Surgery and Endoscopy services. This pivotal leadership role offers an unparalleled opportunity to significantly impact patient care delivery and operational excellence.\n\nThe successful candidate will orchestrate the seamless and safe patient journey from initial admission through advanced procedural stages and comprehensive Phase 2 recovery. You will be instrumental in fostering strategic collaborations with Perioperative Services Leadership, proactively identifying opportunities for optimization, and pioneering innovative solutions to enhance daily operational workflows.\n\nA core responsibility will be to champion continuous professional development and cultivate a culture of excellence within the team, through the meticulous development of educational strategies and the diligent facilitation of ongoing staff competency programs. You will also be entrusted with the cultivation, mentorship, and empowerment of a high-performing team of direct reports, ensuring their growth and collective success.\n\nFurthermore, this role demands astute fiscal oversight, including comprehensive management of the departmental operating budget, strategic resource allocation across supplies, cutting-edge equipment, physical space, and critical information systems. The incumbent will be responsible for implementing robust analytical frameworks and leveraging data-driven insights, utilizing key performance indicators to propel continuous improvement and strategic planning.\n\nMaintaining unwavering adherence to all governmental and agency regulations is paramount. The Operations Manager will champion best practices in infection control, health and safety policies, ensuring a compliant and secure environment at all times.\n\nThis role is ideal for a strategic leader passionate about shaping the future of healthcare operations in a collaborative and forward-thinking environment. We offer a highly competitive compensation package commensurate with experience, alongside a comprehensive suite of benefits, and exceptional opportunities for professional advancement within our esteemed institution.\n\nInterested candidates are invited to submit their comprehensive application directly through our dedicated careers portal: [Bristol Hospital Official Careers Portal]."}
{"original_description_before_llm":"ACCEPTING ONLINE APPLICATIONS ONLYClick Here To Apply This is a Full Time Temporary Position Lasting for 2 yearsDescriptionValidate and review legal contractual agreements for customers Input contract into contract databases All contracts completed &amp; reviewed within per-determined service level agreement Professional e-mail interaction with customers Scanning and uploading of documents QualificationsHigh School Diploma or Equivalent Professional Communication Skills via e-mail interactionDedicated to the needs of the business Project management skills to assist in facilitating multiple contract rejects Detail oriented Able to multi-taskAbility to work with time sensitive documents Must be able to work independently but able to perform in a team environment when needed. Fast and accurate typist ACCEPTING ONLINE APPLICATIONS ONLYClick Here To Apply","description":"**Digital Legal Operations Associate (Term-Limited Engagement)**\n\n**Location:** Remote (Online Operations)\n**Employment Type:** Full-time, Term-Limited (2 Years)\n\n**About the Opportunity:**\nWe are seeking a highly meticulous and dedicated Digital Legal Operations Associate to join our expanding team for a critical two-year engagement. This pivotal role is essential for maintaining the integrity and compliance of our global contractual agreements, contributing directly to our operational efficiency and strategic objectives. This is an unparalleled opportunity to gain significant experience within a dynamic and forward-thinking environment.\n\n**Key Responsibilities:**\n\n*   Thorough validation and comprehensive review of complex legal contractual agreements.\n*   Precise input and integration of validated contract data into our proprietary database systems.\n*   Ensuring stringent adherence to pre-determined Service Level Agreements (SLAs) for all data processing and review cycles.\n*   Fostering professional and effective email-based communication with internal stakeholders and external partners to resolve discrepancies and ensure clarity.\n*   Managing the end-to-end digital lifecycle of legal documentation, including high-volume scanning, meticulous organization, and secure digital archiving.\n*   Contributing to the continuous improvement of data management workflows and compliance protocols.\n\n**Qualifications:**\n\n*   High School Diploma or equivalent; further professional certifications are a plus.\n*   Demonstrable excellence in professional written communication, particularly within email correspondence.\n*   A profound dedication to meeting organizational needs and contributing to broader business success.\n*   Aptitude for meticulous attention to detail and an ability to manage multiple complex tasks concurrently with high accuracy.\n*   Proven capacity to manage and prioritize time-sensitive documents and initiatives effectively.\n*   Ability to operate with a high degree of autonomy while also collaborating seamlessly within a team-oriented framework when required.\n*   Exceptional proficiency in data entry and information management platforms, with a focus on speed and precision.\n\n**Application Process:**\nWe are exclusively accepting online applications for this position. To express your interest and initiate the streamlined application process, please proceed through our secure portal."}
{"original_description_before_llm":"Now hiring CSR \/ Advertising representatives to work from homeMust Have:Customer Service RepresentativeComputerInternetPhoneFor more information call (985) 250-0381Interview Immediately ","description":"**Remote Client Engagement & Brand Outreach Specialist**\n\nJoin a dynamic and forward-thinking organization dedicated to optimizing market presence and fostering robust client relationships. We are actively seeking highly motivated and articulate individuals to become an integral part of our expanding remote team. As a Client Engagement & Brand Outreach Specialist, you will play a pivotal role in amplifying our brand message and cultivating strong connections within our target audience. This is an exceptional opportunity for self-starters who thrive in an autonomous, performance-driven environment.\n\n**Key Responsibilities:**\n\n*   Proactively engage with prospective and existing clients, representing our brand with professionalism and integrity.\n*   Contribute to strategic communication initiatives designed to enhance market awareness and lead generation.\n*   Provide exceptional support and information, ensuring a seamless and positive experience for all stakeholders.\n*   Participate in the refinement of outreach strategies and contribute to ongoing brand advocacy efforts.\n*   Manage assigned client portfolios, ensuring timely and effective communication.\n\n**Qualifications:**\n\n*   Exceptional verbal and written communication skills with a persuasive and professional demeanor.\n*   A proactive, results-oriented mindset with the ability to manage tasks independently and efficiently.\n*   Demonstrated capability to thrive in a remote work setting, maintaining high levels of productivity and organization.\n*   **Essential Home Office Setup:** Reliable high-speed internet connectivity, a dedicated computer, and professional communication equipment (e.g., headset, phone).\n*   Prior experience in client-facing roles, communications, or promotional activities is advantageous, though not strictly required for highly driven candidates possessing strong intrinsic motivation and a quick learning aptitude.\n\n**Benefits & Opportunities:**\n\n*   Significant earning potential tied directly to performance and contribution.\n*   Flexible scheduling options designed to support an optimal work-life balance.\n*   Comprehensive training and ongoing professional development resources to foster your growth.\n*   The chance to be a key contributor within a rapidly evolving industry, making a tangible impact.\n\n**Application Process:**\n\nWe are actively reviewing applications and committed to an expedited onboarding process for top talent. For immediate consideration and to discuss this compelling opportunity further, please connect directly with our Talent Acquisition Team at (985) 250-0381. Qualified candidates will be prioritized for an accelerated virtual assessment."}
{"original_description_before_llm":"Our organisation is seeking students \/ graduates with a finance, business or commerce related degree qualifications. We want to hear from you if you are seeking experience in genuine, professional environments. We have several exceptional positions available for immediate start. You will be degree qualified or partially through your degree with good attention to detail as well as good communication skills. You will also have strong organisational skills, a willingness to learn coupled with exceptional numerical skills. Position: You will ultimately be responsible for supporting the accounting team in general finance admin responsibilities. This will include high volume data entry that will require phenomenal attention to detail and strong Excel skills. You will be responsible for working proactively to investigate and resolve queries with internal stakeholders.","description":"**Financial Operations Associate - Entry Level**\n\nAre you an ambitious and analytical student or recent graduate seeking an unparalleled opportunity to launch your career within a dynamic and high-performing professional environment? Our rapidly expanding organization is actively seeking exceptional talent from Finance, Business, or Commerce disciplines to join our esteemed team. We invite applications from highly motivated individuals who are either currently pursuing their degree or have recently completed their qualifications.\n\nThis is a pivotal entry-level position designed for aspiring professionals eager to gain substantive experience and contribute meaningfully from day one. You will play a crucial role in supporting our financial operations, collaborating closely with seasoned experts to ensure the seamless integrity of our financial data and processes.\n\n**Key Responsibilities:**\n*   Execute high-volume, meticulous information management and data reconciliation processes with unwavering precision, utilizing advanced proficiency in Microsoft Excel and other financial tools.\n*   Proactively identify, analyze, and resolve complex financial discrepancies and inquiries, serving as a key liaison for various cross-functional internal stakeholders.\n*   Contribute to the optimization of critical financial administration workflows, ensuring accuracy and efficiency in all operations.\n*   Provide essential support to our accounting and finance teams, contributing to strategic initiatives and operational excellence.\n\n**Qualifications:**\n*   Currently enrolled in or a recent graduate of a Bachelor's degree program in Finance, Business, Commerce, or a related field.\n*   Demonstrated meticulous attention to detail and a commitment to data integrity.\n*   Exceptional numerical aptitude and analytical problem-solving skills.\n*   Strong organizational capabilities with the ability to manage multiple priorities in a fast-paced environment.\n*   Excellent written and verbal communication acumen, with the ability to articulate complex information clearly.\n*   A proactive mindset, inherent willingness to learn, and a strong desire for continuous professional development.\n\nThis role offers an immediate start, providing a unique trajectory for rapid professional ascent within our organization. If you are driven, detail-oriented, and ready to make a significant impact, we encourage you to apply and become part of our success story."}
{"original_description_before_llm":"We are a full-service marketing and staffing firm, serving companies ranging from Fortune 100 to new start-up organizations. We work with job seekers in an equally broad range, from light industrial temporary workers to executive level candidates.Are you looking for a Work from Home Opportunity where you can earn up to $2500 and more per week? Our Online Service Representative position would be perfect for you!- Set your own hours - Make money every time you decide to work - Work remotely from home - Get paid weekly - If you have a computer with internet, this is for you","description":"As a dynamic, full-service marketing and staffing firm, we pride ourselves on partnering with an exceptionally diverse clientele, spanning from established Fortune 100 enterprises to innovative emerging startups. Our commitment extends equally to job seekers, assisting a wide spectrum of professionals, from highly skilled temporary talent to executive-level leadership.\n\nWe are currently seeking highly motivated and self-disciplined individuals for the pivotal role of Virtual Service Coordinator. This remote opportunity offers substantial earning potential for those adept at managing digital operations and contributing to our client success initiatives.\n\n**Key Responsibilities:**\n\n*   Facilitate seamless digital information flow and data integrity across various platforms.\n*   Provide sophisticated administrative and coordination support to optimize operational efficiency.\n*   Engage proactively with digital tools and resources to streamline service delivery.\n*   Contribute to enhanced client satisfaction through meticulous remote support and correspondence management.\n\n**Why Join Our Team:**\n\n*   **Unparalleled Schedule Autonomy:** Design your own work hours to align with personal commitments, empowering you to maximize productivity and work-life integration.\n*   **Performance-Driven Compensation:** Directly influence your earnings through your dedication and output, with a transparent and robust remuneration model designed for significant weekly potential.\n*   **Flexible Remote Work Structure:** Operate entirely from your preferred home office, leveraging cutting-edge digital platforms to connect and collaborate.\n*   **Consistent Weekly Disbursements:** Enjoy the security and convenience of regular, predictable weekly payments.\n\n**Ideal Attributes:**\n\nWe are looking for individuals who are organized, possess strong attention to detail, and are comfortable navigating digital environments independently. A reliable high-speed internet connection and a modern, fully functional computing device are essential for success in this role.\n\nIf you are eager to embrace a flexible, results-oriented professional endeavor with considerable growth prospects, we encourage you to express your interest."}
{"original_description_before_llm":"We are looking for a contractors\/individual who can perform general maintenance and repairs on residential properties. Work may include but no limited the following: - Grass Cuts - General Repairs \/ Perform per bid approvals - Trash Outs (Debris Removal) - Eviction Services - Initial Secures\/Securing (replacing locks) - Winterizations - Boarding - Mold Remediation - Cash for Keys - Janitorial Cleaning of home interior","description":"We are seeking highly skilled independent contractors to join our esteemed network of property preservation and restoration specialists. As a valued partner, you will play a critical role in maintaining the integrity and value of a diverse portfolio of residential assets. We are looking for professionals adept at executing a wide range of services, ensuring properties are consistently secure, well-maintained, and prepared for various stages of occupancy or transition.\n\nKey areas of expertise and responsibility include, but are not limited to:\n\n*   **Exterior Grounds Management:** Comprehensive landscaping and routine maintenance services.\n*   **Comprehensive Property Repair & Renovation:** Execution of approved remedial action plans and general property enhancements.\n*   **Property Debris Management & Site Clearance:** Efficient removal and disposal of various materials to ensure pristine conditions.\n*   **Property Transition & Vacancy Management:** Sensitive support services during tenant departures, including eviction support when necessary.\n*   **Initial Property Securitization & Access Control:** Implementation of immediate security measures and lock replacement to safeguard assets.\n*   **Seasonal Property Preservation & Winterization:** Adherence to critical protocols to protect properties from environmental damage.\n*   **Structural Protection & Board-Up Services:** Securing compromised areas to prevent further damage or unauthorized access.\n*   **Environmental Hazard Mitigation & Remediation:** Specialized services for addressing and resolving conditions such as mold.\n*   **Tenant Relocation Incentive Program Facilitation:** Management of strategic programs to encourage smooth property transitions.\n*   **Interior Property Detailing & Sanitization:** High-standard cleaning and preparation for new occupants or market readiness.\n\nWe offer flexible project assignments, competitive compensation for completed work, and the opportunity to manage a dynamic portfolio of projects. This is an ideal engagement for self-motivated individuals or contracting firms committed to excellence and reliability.\n\nTo express your interest and be considered for our network, please submit a detailed overview of your capabilities, relevant experience, and any certifications."}
{"original_description_before_llm":"Data Center Migration Application Lead \/ Architect – must have prior large data center and applications migrations experience10-15 Years of Experience \/ 10+Years of experience in infrastructure \/data center \/application migrationKnowledgeable of Tools required (e.g. Platespin, BMC ADDM etc.) to support data gathering and migration• The Migration Lead Engineer must be experienced and proficient in producing complex migration strategies and supporting artifacts including requirements discovery and analysis. The formulation of solution context, identification of solution alternatives and their assessment, technology selection, and final Execution plans.","description":"**Enterprise Data Center & Application Transformation Principal Architect**\n\nWe are seeking an exceptionally accomplished and visionary **Principal Architect** to spearhead our most ambitious and critical enterprise-wide data center and application migration initiatives. This highly strategic role demands a proven leader with an unparalleled track record in orchestrating complex, large-scale infrastructure transformations.\n\n**Key Qualifications:**\n\n*   A minimum of 10-15 years of progressive and demonstrably impactful experience, specializing in the end-to-end planning, design, and execution of comprehensive data center and application migration programs within diverse, complex organizational landscapes.\n*   Profound mastery of advanced migration methodologies and a sophisticated command of industry-leading platforms and tools (e.g., Platespin, BMC ADDM, etc.), leveraging their capabilities to drive strategic insights and optimize solution delivery.\n\n**Core Responsibilities:**\n\n*   Architect, champion, and lead the development of highly intricate, multi-faceted migration strategies, translating overarching business objectives into robust, scalable, and resilient architectural blueprints.\n*   Drive the complete lifecycle of transformative migration projects, encompassing rigorous requirements discovery, comprehensive impact analysis, and the meticulous formulation of innovative solution contexts.\n*   Lead the exhaustive evaluation and strategic selection of optimal technological alternatives, ensuring alignment with long-term organizational goals, operational excellence, and future-state capabilities.\n*   Develop sophisticated, actionable execution plans that guarantee seamless transitions, minimal business disruption, and the maximization of value realization across all affected enterprise systems.\n*   Provide authoritative architectural leadership and strategic influence, guiding cross-functional teams and key stakeholders to foster a culture of innovation, precision, and successful large-scale program delivery.\n\nThis pivotal opportunity offers the chance to redefine the technological backbone of our organization, contributing to mission-critical transformations that will shape our future trajectory. We are seeking a pioneering thought leader capable of establishing next-generation migration paradigms."}
{"original_description_before_llm":"Description:Sales Engineers are a key point of contact for clients and provide both pre- and post-sales advice. They liaise regularly with other members of the sales team and colleagues from a range of departments; such as account management, product development, marketing, finance, engineering, as well as senior company managers.Sales Engineers must be able to articulate technology and product positioning to both business and technical users. They must also be able to identify all technical issues of assigned accounts to assure complete customer satisfaction through all stages of the sales process, and must be able to establish and maintain strong relationships throughout the sales cycle and beyond.Sales Engineers would report into the head of sales.Responsibilities:Actively drive and manage the technical pitch of the Platform for Advertisers, Networks and Publishers (ATA\/ATN);Develop sales opportunities by researching and identifying potential accounts, soliciting new accounts, building rapport and providing technical information and explanations;Provide pre-sales technical assistance and product education, and post-sales support services;Create technical presentations and demonstrations on how a product can meet the client needs;Develop long-term relationships with new and existing clients through managing and interpreting their requirements;Persuade clients that a product or service best satisfies their needs in terms of quality, price and delivery (e.g., simplicity);Able to respond to functional and technical elements of RFIs\/RFPs;Search for new clients who might benefit from company products or services and maximize client potential;Assess competitors by analyzing and summarizing competitor information and trends, and identify sales opportunities;Update job knowledge by studying new product descriptions, participating in educational opportunities, attending trade shows, conferences and other marketing events;Liaison with other members of the sales team and other technical experts;Convey customer requirements to product management and engineering teams;Meet regular sales targets and coordinate sales projects;Able to travel throughout sales territory.","description":"**Sales Engineer**\n\nAre you a highly driven and technically astute professional with a passion for innovation and client success? We are seeking an exceptional Sales Engineer to join our dynamic team and play a pivotal role in shaping our market leadership. In this strategic position, you will serve as a crucial interface between our groundbreaking technological solutions and our esteemed clientele, driving both pre- and post-sales engagement.\n\nThis role offers a unique opportunity to collaborate seamlessly with cross-functional teams, including Account Management, Product Development, Marketing, Finance, Engineering, and Senior Leadership. The successful candidate will possess the remarkable ability to masterfully articulate complex technical solutions and product positioning to diverse audiences, encompassing both sophisticated technical users and key business stakeholders. You will be instrumental in proactively identifying and resolving technical complexities for assigned accounts, ensuring unparalleled client satisfaction throughout every phase of the sales cycle and cultivating enduring, high-value partnerships. This high-visibility role reports directly to the Head of Sales.\n\n**Key Responsibilities:**\n\n*   Spearhead the technical presentation and strategic positioning of our cutting-edge Platform for Advertisers, Networks, and Publishers (ATA\/ATN), serving as the primary technical expert.\n*   Proactively cultivate new business opportunities through rigorous market research, strategic outreach, and the meticulous cultivation of robust client relationships, offering unparalleled technical insights and bespoke solutions.\n*   Deliver comprehensive pre-sales technical consultation and advanced product education, complemented by responsive and effective post-sales support services, ensuring a seamless and exceptional client journey.\n*   Design and execute compelling technical presentations and bespoke demonstrations that precisely articulate how our solutions address and exceed complex client requirements.\n*   Forge and nurture enduring strategic partnerships with both prospective and existing clients by expertly discerning and translating their evolving business needs into actionable technical strategies.\n*   Masterfully persuade clients of the superior value proposition of our products and services, emphasizing their unparalleled quality, competitive positioning, and streamlined integration capabilities.\n*   Expertly respond to the intricate functional and technical specifications outlined in Requests for Information (RFIs) and Requests for Proposals (RFPs), ensuring comprehensive and compelling submissions.\n*   Strategically identify and engage with high-potential prospects, meticulously analyzing their needs to maximize their adoption and long-term value from our innovative solutions.\n*   Conduct in-depth competitive analyses, discerning market trends and competitor strategies to proactively identify and capitalize on emergent sales opportunities.\n*   Continuously enhance technical and market expertise through dedicated self-study of new product advancements, engaging in high-level educational opportunities, and active participation in premier industry events.\n*   Collaborate seamlessly with cross-functional sales teams and esteemed technical experts to ensure cohesive and integrated client strategies.\n*   Serve as a critical conduit, meticulously translating complex client requirements into actionable insights for our product management and engineering teams, influencing product roadmap development.\n*   Consistently achieve and exceed ambitious sales targets, and adeptly manage complex sales initiatives from inception to successful completion.\n*   Possess the flexibility and willingness to undertake strategic travel within the assigned sales territory to engage with key clients and attend industry-defining events.\n\nThis is an exceptional opportunity for an ambitious individual to significantly impact our growth trajectory and advance their career within a forward-thinking organization. If you are ready to drive significant revenue growth and contribute to a transformative platform, we encourage you to apply."}
{"original_description_before_llm":"We have several openings available in this area earning $1000.00-$2500.00 per week. We are seeking only honest, self-motivated people with a desire to work in the home typing and data entry field, from the comfort of their own homes.The preferred applicants should be at least 18 years old with Internet access. No experience is needed. However the following skills are desirable:  ","description":"Join our rapidly expanding virtual operations division as a Remote Information Processing Specialist. We are actively recruiting highly motivated and exceptionally detail-oriented individuals who are passionate about contributing to efficient data management and digital content integrity.\n\nThis fully remote opportunity provides unparalleled flexibility, allowing you to achieve an optimal work-life balance while contributing to critical information initiatives. We offer a highly competitive compensation structure with potential weekly earnings ranging from $1,000 to $2,500, commensurate with performance and dedication.\n\nCandidates must be at least 18 years of age and possess a reliable high-speed internet connection along with a dedicated home office setup. While extensive prior experience in data entry is not a mandatory prerequisite, comprehensive training will be provided to successful candidates to ensure proficiency in our proprietary systems.\n\nIdeal applicants will demonstrate:\n*   Exceptional attention to detail and unwavering commitment to accuracy.\n*   Strong organizational and time management skills, crucial for independent work.\n*   Proficiency with standard office productivity software.\n*   A proactive, self-disciplined approach to tasks and an eagerness to learn.\n\nIf you are poised to leverage your diligence and focus within a dynamic, independent work environment, we invite you to submit your qualifications for immediate consideration."}
{"original_description_before_llm":"Description of the Church Administrative AssistantThe Church Administrative Assistant serves under the direct supervision of the Senior Pastor, to manage all activities of the main church office and perform administrative duties related to the church’s operation. This is a full time #URL_b74a96d67e677fe50326f5185df3e9f22ca81b928c4e286b6d7dccc397d2e7ac# for this postion should be of a Pentacostal or Baptist background and the church is apart of the Full Gospel Church Fellowship Organization.","description":"**Church Operations Administrator**\n\nOur thriving faith community seeks a highly dedicated and meticulous Church Operations Administrator to oversee the comprehensive administrative functions of our main office. Reporting directly to the Senior Pastor, this full-time role is pivotal in ensuring the seamless daily operations and strategic support for our diverse ministries. As an integral part of the Full Gospel Church Fellowship Organization, we are committed to fostering a supportive and impactful environment for both our staff and congregants.\n\n**Key Responsibilities:**\n\n*   Provide high-level administrative and executive support to the Senior Pastor, managing complex schedules, correspondence, and confidential matters with utmost discretion.\n*   Lead the efficient management of church office systems, including advanced information management, record-keeping, and communication protocols.\n*   Serve as a primary liaison for internal and external stakeholders, ensuring professional and timely communication across all platforms.\n*   Facilitate the coordination and successful execution of church programs, events, and community outreach initiatives.\n*   Oversee inventory, resource allocation, and general office maintenance, fostering an organized and productive working environment.\n*   Contribute to operational enhancements and process improvements, identifying opportunities to bolster efficiency and overall organizational effectiveness.\n\n**Qualifications:**\n\n*   Demonstrated experience in a comprehensive administrative or office management capacity, ideally within a faith-based or non-profit organization.\n*   Exceptional organizational skills, with a proven ability to manage multiple priorities, exercise meticulous attention to detail, and meet deadlines.\n*   Advanced proficiency in contemporary office software suites (e.g., Microsoft Office 365, Google Workspace) and office management technologies.\n*   Superior interpersonal and communication skills, both written and verbal, maintaining a professional and empathetic demeanor.\n*   A background deeply rooted in, or a profound understanding of, Pentecostal or Baptist faith traditions, enabling a cohesive integration with our spiritual ethos and denominational principles.\n*   Unwavering commitment to confidentiality, integrity, and ethical conduct.\n\n**Why Join Us:**\n\nThis role offers a unique opportunity to contribute significantly to our mission, working within a vibrant and deeply committed community. We provide an environment that encourages autonomy, professional growth, and direct impact on the spiritual lives of our congregants. Competitive compensation and a supportive team culture await the ideal candidate."}
{"original_description_before_llm":"Ref: HOVER-ORC-B55UK07-14Hotel Verta, a luxury boutique hotel located on the River Thames, is the smart choice for an truly memorable London stay. Offering all the facilities you would expect from a deluxe Central London hotel, but located just outside the hustle and bustle of the city centre means we can offer so much more for so much less.Easily accessible, located just outside the congestion zone with ample onsite parking, and Hotel Verta is the hidden gem that enables you to save on rate without compromising on luxury on your stay in London.As part of our expansion activities, we welcome applications from suitably qualified candidates for a possible job placement here at the Hotel Verta. We currently seek candidates with initiatives who takes pride in their work and with prior experience. Opportunities exist across all areas of the hotel.Reception Manager, Restaurant &amp; Bar Manager, Entertainment Manager, Operations Manager, Sales\/Marketing Manager, Account &amp; Finance Manager, Food &amp; Catering Manager, Casino Manager, Business Analyst, Human Resources Assistant, Guest Relations (Host), Secretary, Office Assistant, Receptionist, Front Desk Attendant, Account\/Finance Officer, Sales\/Marketing Officer, Cashier, Computer Operator, Internet Expert, System Administrator, Bartender, Barman, Chefs (Chef de Partie, Commis Chef &amp; Sous Chef), Banquet Coordinator, Medical Officer(Nurse\/Doctor), Language Translator\/Interpreter, Safety Officer, Spa (Receptionist, Therapist &amp; Manager), Beauty Therapist, Cafe Attendant, Events Sales Coordinator, Security Supervisor, Security Officer, Housekeeping Supervisor, Head Housekeeper, Maintenance Technician (Electrical &amp; Mechanical), Maintenance Assistant, Conference &amp; Event Planner, Food &amp; Beverage Supervisor, Room Attendant, Lobby Executive &amp; Assistant, Store Keeper, DriverJOB TYPE: PermanentJOB STATUS: Full TimeJOB LOCATION: London, United Kingdom","description":"Ref: HOVER-ORC-B55UK07-14\n\n**Discover Excellence: Join the Team at Hotel Verta, London**\n\nHotel Verta, an emblem of sophisticated luxury nestled on the iconic River Thames, offers an unparalleled boutique experience in London. Strategically positioned just beyond the city's vibrant core, we provide the ultimate blend of tranquility, accessibility, and deluxe amenities. Our commitment to refined hospitality and exceptional guest experiences defines our identity as a premier destination, ensuring a distinguished stay without compromise on elegance or value. With ample on-site parking and easy access outside the congestion zone, Hotel Verta represents a hidden gem where luxury meets convenience.\n\nIn anticipation of our strategic growth and continued commitment to unparalleled service, Hotel Verta is actively seeking dedicated and exceptionally talented professionals to join our esteemed team. We are expanding our operational footprint and are keen to connect with individuals who embody initiative, demonstrate unwavering pride in their craft, and possess a proven track record of excellence within a luxury hospitality environment.\n\nWe are currently inviting applications for a wide spectrum of roles that contribute to our holistic guest experience. Opportunities are available across diverse departments, reflecting our comprehensive service offerings:\n\n*   **Leadership & Management:** Reception Manager, Restaurant & Bar Manager, Entertainment Manager, Operations Manager, Sales\/Marketing Manager, Account & Finance Manager, Food & Catering Manager, Casino Manager, Conference & Event Planner, Food & Beverage Supervisor, Security Supervisor, Housekeeping Supervisor, Head Housekeeper, Spa Manager, Lobby Executive & Assistant\n*   **Administrative & Support:** Business Analyst, Human Resources Assistant, Secretary, Office Assistant, Store Keeper\n*   **Guest Services:** Guest Relations (Host), Receptionist, Front Desk Attendant, Room Attendant, Cafe Attendant, Beauty Therapist, Spa Receptionist, Spa Therapist\n*   **Finance & Sales:** Account\/Finance Officer, Sales\/Marketing Officer, Cashier, Events Sales Coordinator\n*   **Culinary & Beverage:** Bartender, Barman, Chefs (Chef de Partie, Commis Chef & Sous Chef), Banquet Coordinator\n*   **Technical & IT:** Computer Operator, Internet Expert, System Administrator, Maintenance Technician (Electrical & Mechanical), Maintenance Assistant\n*   **Specialized Roles:** Medical Officer (Nurse\/Doctor), Language Translator\/Interpreter, Safety Officer, Security Officer, Driver\n\n**JOB TYPE:** Permanent\n**JOB STATUS:** Full Time\n**JOB LOCATION:** London, United Kingdom\n\nWe offer a dynamic and supportive work environment, competitive remuneration, and significant opportunities for career advancement within a prestigious luxury brand. If you possess the requisite skills, a passion for delivering exceptional guest experiences, and a dedication to upholding the highest standards of service, we invite you to submit your comprehensive CV and a cover letter detailing your relevant experience and career aspirations.\n\nShortlisted candidates will be contacted for further assessment."}
{"original_description_before_llm":"Benefits company looking to hire several Customer Service Representatives. This is a virtual position and all Candidates must be comfortable working from their homes.","description":"As a forward-thinking leader in comprehensive benefits solutions, we are actively seeking highly motivated and compassionate Client Support Associates to join our rapidly expanding virtual team. In this pivotal remote role, you will be instrumental in delivering unparalleled service excellence, guiding our diverse clientele through their benefits journey, and ensuring seamless interactions. You will leverage advanced communication platforms to address inquiries, provide insightful information, and foster lasting relationships, directly contributing to our reputation for client satisfaction. This fully remote position requires candidates to possess a dedicated, professional, and quiet home office environment with reliable high-speed internet access. We offer an exceptional opportunity for professional growth within a dynamic and supportive culture. Enjoy significant flexibility, a highly competitive compensation package commensurate with experience, and access to comprehensive training designed to accelerate your career trajectory. Join an organization committed to innovation, employee well-being, and making a meaningful impact."}
{"original_description_before_llm":"We are seeking a full time Payroll Clerk to manage day to day accounting for our operation.PAY SCALE : $25\/hr• Maintains financial controls including shrink, payroll and other operating expenses, rebates .• Maintaining proper inventory controls, facilitate inventory transactions and maintain compliance standards for shrink control• Monitor sales activities to ensure that customers receive satisfactory service.","description":"**Financial Operations Coordinator**\n\nWe are seeking a highly diligent and versatile Financial Operations Coordinator to join our dynamic team. This pivotal role is central to maintaining the fiscal integrity and operational efficiency of our enterprise, demanding meticulous attention to detail and a proactive approach.\n\n**Key Responsibilities:**\n\n*   **Comprehensive Financial Administration:** Administer intricate payroll processes, ensuring absolute accuracy, timeliness, and strict adherence to all regulatory requirements and internal compliance standards. Oversee daily financial reconciliations and contribute significantly to month-end closing procedures.\n*   **Strategic Fiscal Control & Asset Protection:** Implement and rigorously monitor robust internal financial controls across various operational expenditures. Develop and maintain proactive strategies for effective asset protection and loss prevention, including detailed analysis of inventory discrepancies and comprehensive management of rebate programs.\n*   **Operational Efficiency & Resource Management:** Facilitate precise inventory transactions and uphold stringent compliance standards for optimal supply chain efficiency and complete asset integrity. Collaborate cross-functionally to optimize resource allocation and minimize operational inefficiencies.\n*   **Service Excellence & Client Engagement:** Proactively analyze sales activities and client engagement metrics to ensure the consistent delivery of exceptional service quality, identifying strategic opportunities for process improvement and enhanced customer satisfaction.\n\n**Compensation:** We offer a competitive hourly rate, commensurate with experience and the multifaceted nature of this role, typically ranging from $25 - $30 per hour, along with opportunities for continuous professional development and advancement within a stimulating, growth-oriented environment."}
{"original_description_before_llm":"2132Job Title: Project Manager New Product Introduction AerospaceRole: Project ManagerRelocation Available: YesIndustry: AerospaceLocation: OhioTown \/ City: West ChesterJob Type: Permanent full-timeJob description:Company has an exciting career opportunity for a dynamic Project Manager to play an integral role in driving and supporting their business goals and objectives for profitable, sustainable growth. The right candidate should have a proven track record of leadership and building collaborative teams, to bring about results for new product introductions. The Aerospace Project Manager will act as a proactive liaison between the local division and the Director, Global Business Development with the goal of exceeding customer expectations for new product introductions. Lead and coordinate new product introduction activities within the site working with the various cross-functional new product introduction teams.The PM is responsible for delivering the new product introduction projects on schedule, within budget and with quality performance.Effectively manage customer projects through their life cycle: initiating, planning, executing, controlling, and closing.Primary communicator of project status horizontally and vertically throughout the organization.Provide direction to achieve project financial performance metrics, including program sales, P&amp;L, inventory levels, etc.  Must have experience with New Product Introduction (NPI).Assist in the management of Customer contracts including achievement, compliance, and communication of contractual requirements to the appropriate functional areas of the organization; monitoring Customer and company performance to these requirements.Effectively communicate and share information, knowledge and expertise between projects and disciplines.Follow the proper governance for PM projects to meet the customer program expectations by meeting expectations, establishing cohesive policies and process.Support the development of major project proposals by assisting in the development of robust project plans utilizing core project management methodology.Coach and mentor the project teams on project management methodology and best practices.  Required SkillsBachelor's degree in engineering or equivalent required.  MS\/MBA or PMP certification preferred.Fast-paced, self-starter with the ability to make decisions with limited information.Strong leadership and people engagement skills; leads by example using leadership effectiveness.Develops effective working relationships which foster integrity, trust and respect.General knowledge of financial terms and concepts (inventory and budgetary).Lean or Six Sigma certification a plus.Excellent computer and data analysis skills. The Aerospace Project Manager must be proficient in Microsoft Project, Word, Excel, PowerPoint, and Outlook.Required Experience6 to 10 years management experience required, preferably in a manufacturing environment. Aerospace experience is required.Bottom Line Requirements:1.  Bachelor's degree in engineering or equivalent required.  MS\/MBA or PMP certification preferred.2.  6 to 10 years project management experience in an aerospace manufacturing environment.3.  Inventory and budgetary experience. 4.  Lean or Six Sigma certification a plus.","description":"**Strategic Project Director, New Product Innovation (Aerospace Sector)**\n\n**Role:** Spearheading strategic initiatives for advanced aerospace solutions.\n**Relocation Available:** Yes\n**Industry:** Aerospace\n**Location:** Ohio, West Chester\n**Job Type:** Permanent, Full-time\n\n**About the Opportunity:**\nOur pioneering enterprise, a recognized leader in aerospace innovation, extends an unparalleled invitation to a visionary Strategic Project Director. This pivotal role is designed for an exceptional leader poised to significantly influence our trajectory towards expansive and sustainable market leadership. We seek an individual with a distinguished record of orchestrating high-performance collaborative teams, consistently delivering groundbreaking results in complex New Product Introduction (NPI) cycles.\n\nAs a key architect of our future, the Strategic Project Director will serve as the principal nexus between our agile operational divisions and the Global Business Development leadership. This critical interface ensures the seamless integration of market insights with product realization, consistently exceeding sophisticated customer expectations and setting new benchmarks for innovation.\n\n**Core Responsibilities:**\n*   Orchestrate and optimize end-to-end New Product Introduction (NPI) initiatives across multidisciplinary teams, ensuring meticulous adherence to aggressive timelines, fiscal parameters, and the highest echelons of quality performance.\n*   Masterfully navigate the complete project lifecycle from strategic inception and meticulous planning to dynamic execution, rigorous control, and definitive closure, consistently delivering transformative outcomes for our esteemed clientele.\n*   Serve as the authoritative conduit for all project communications, disseminating critical insights and strategic imperatives with unparalleled clarity across all organizational strata.\n*   Drive compelling financial performance, meticulously overseeing program sales, optimizing profit and loss statements, and strategically managing inventory assets to foster sustained growth and profitability.\n*   Expertly manage intricate customer contracts, ensuring rigorous compliance, proactive communication of contractual obligations, and vigilant oversight of both internal and external performance benchmarks.\n*   Cultivate a vibrant ecosystem of knowledge exchange, fostering cross-functional synergy and the seamless dissemination of insights and best practices to elevate collective expertise.\n*   Champion adherence to rigorous project governance frameworks, ensuring unwavering alignment with customer aspirations and the establishment of leading-edge operational policies and processes.\n*   Provide strategic counsel and hands-on support in the formulation of high-stakes project proposals, architecting robust and agile project plans grounded in advanced project management methodologies.\n*   Act as a transformative mentor, empowering project teams through comprehensive coaching on contemporary project management paradigms and pioneering best practices.\n\n**Candidate Profile:**\nCandidates for this distinguished role are expected to possess an exceptional blend of academic rigor, strategic acumen, and demonstrable leadership capabilities.\n\n**Required Qualifications:**\n*   **Educational Foundation:** A Bachelor's degree in Engineering or a closely related technical discipline is fundamental. An advanced degree (MS\/MBA) or Project Management Professional (PMP) certification is highly advantageous, reflecting a commitment to professional mastery.\n*   **Strategic Agility:** Proven capacity to thrive in a dynamic, high-velocity environment, exhibiting unparalleled proactivity and the astute judgment required to navigate complex decisions with limited data points.\n*   **Transformational Leadership:** Superior ability to inspire, influence, and unify diverse teams, leading by unwavering example and cultivating a culture of peak performance, integrity, trust, and mutual respect.\n*   **Financial Acuity:** Profound understanding of intricate financial concepts, including comprehensive P&L management, strategic inventory optimization, and robust budgetary oversight.\n*   **Operational Excellence:** Certification in Lean or Six Sigma methodologies is a significant differentiator, indicating a dedication to continuous improvement and process optimization.\n*   **Technological Proficiency:** Exceptional analytical and data synthesis capabilities, coupled with mastery of enterprise-level project management software and the Microsoft Office Suite (MS Project, Word, Excel, PowerPoint, Outlook).\n\n**Experience Prerequisites:**\n*   A minimum of 6 to 10 years of progressive leadership experience in complex project management within a highly regulated manufacturing sector is essential. Deep, demonstrable expertise within the Aerospace industry is non-negotiable.\n\n**Mandatory Qualifications for Consideration:**\n1.  An accredited Bachelor's degree in Engineering or a closely related technical discipline; an advanced degree (MS\/MBA) or PMP certification is highly regarded.\n2.  A minimum of 6 to 10 years of specialized, high-impact project management leadership within the aerospace manufacturing ecosystem.\n3.  Comprehensive proficiency in financial stewardship, encompassing P&L accountability, inventory optimization, and robust budgetary controls.\n4.  Demonstrated commitment to operational excellence, ideally evidenced by Lean or Six Sigma certification."}
{"original_description_before_llm":"We are seeking individuals to be connected with companies who are hiring employees directly to work from their homes. You will find both full-time and part-time opportunities in a variety of career fields including but not limited to: data entry, customer support, billing, typing, and administrative.These positions guarantee wages ranging from $12 per hour up to six figure salary. This includes bonuses, benefits, and flexibility over your work schedule.Legitimate work from home jobs are going to require that you have skills relevant to the position you’re applying for. Training is provided based on the position.","description":"Our esteemed talent acquisition firm is currently sourcing highly motivated and self-directed professionals for exclusive remote opportunities within our diverse network of premier organizations. We facilitate direct placement into full-time and part-time roles that offer unparalleled flexibility and autonomy, empowering individuals to thrive from their home offices.\n\nWe are actively seeking candidates across a spectrum of professional domains, including but not limited to: Advanced Information Management, Client Relationship Optimization, Digital Content Transcription, Financial Operations Coordination, and Executive Administrative Support. These roles demand a meticulous approach and a commitment to excellence.\n\nSuccessful candidates will be rewarded with highly competitive compensation packages, encompassing robust performance-based incentives and comprehensive benefits designed to support holistic well-being. Earning potential is substantial, with opportunities for significant career advancement and six-figure remuneration for highly specialized or executive-level profiles. We champion work-life integration and provide an environment where your contributions are recognized and generously rewarded.\n\nWhile foundational proficiencies relevant to your chosen specialization are essential, successful applicants will benefit from bespoke onboarding programs and continuous professional development resources, ensuring a seamless transition and sustained growth within your role. We are committed to fostering a supportive and innovative remote work ecosystem."}
